---
type: MEPHiddenLineSettings
namespace: Autodesk.Revit.DB.Mechanical
version: 2024
members: 7
tags: [revit-api, class]
---

# MEPHiddenLineSettings

`Autodesk.Revit.DB.Mechanical.MEPHiddenLineSettings` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetMEPHiddenLineSettings | 2022 | `public static MEPHiddenLineSettings GetMEPHiddenLineSettings ( Document doc )` |
| Property | DrawHiddenLine | 2022 | `public bool DrawHiddenLine { get ; set ; }` |
| Property | InsideGap | 2022 | `public double InsideGap { get ; set ; }` |
| Property | LineStyle | 2022 | `public ElementId LineStyle { get ; set ; }` |
| Property | OutsideGap | 2022 | `public double OutsideGap { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | SingleLineGap | 2022 | `public double SingleLineGap { get ; set ; }` |